# StationingFeet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..StationingFeet Property
UnitTypeId Class See Also
---
Feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId StationingFeet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StationingFeet As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StationingFeet {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace